

//======================================== ЦИКЛЫ =============================================================

// Цикл - управляющая конструкция в высокоуровневых языках програмирования, предназначенная для организации многократного исполнения набора инструкций.

// Тело цикла - последовательность инструкций для многократного исполнения.

//   Итерация - единичное выполнение цикла.

// Условие выхода - выражение, определяющее будет выполняться цикл или завершится.

// Счетчик - переменная, хранящая текущий номер итерации.



// ------------------------------------Цикл while -------------------------------

//   Цикл с предусловием - цикл, который выполняется пока истинно некоторое условие, указанное перед его началом.

//   Инструкция - while создает цикл, котрый выполняет блок кода пока условие проверки оценивается как true.

//   while(expression) {
//   код, тело цикла (statment)
//   }


// let counter = 0;

// while (counter < 10) {
//   console.log(`counter:` , counter);
//   counter += 1;
// }


// let clientsCounter = 18;
// const maxClients = 25;


// while (clientsCounter < maxClients) {
//   console.log(clientsCounter);
//   clientsCounter += 1;
// }


